Can't cut host for inserted objects
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId HostCutoutForInsertionFailure { get; }
  Visual Basic
Public Shared ReadOnly Property HostCutoutForInsertionFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ HostCutoutForInsertionFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CutFailures Class
  Autodesk.Revit.DB Namespace